<?php
return array(
	/**
	  * 上传文件相关的配置
	  */
	'UPLOAD_MAX_SIZE'		=> 2000000,// 上传文件的最大值
	
	/**
	 * 账号类型
	 */
	'BANK_SHORT'			=>array(
			'BC'	=>"中国银行",
			'ICBC'	=>"中国工商银行",
			'CMB'	=>"中国招商银行",
			'CBC'	=>"中国建设银行",
			'ABC'	=>"中国农业银行",
			'PBC'	=>"中国人民银行",
			'CEB'	=>"中国光大银行",
			'CTB'	=>"中国交通银行",
			'CUB'	=>"中国农村信用社",
			'HXB'	=>"华夏银行",
			'CITIC'	=>"中信实业银行",
		),
		
	/**
	 * 会员状态
	 */
	'MEMBER_STATUS'			=>array(
			'0'		=>	"<span style=\"color:green\">正常</span>",
			'1'		=>	"<span style=\"color:orange\">待审</span>",
			'2'		=>	"<span style=\"color:red\">锁定</span>",
			'3'		=>	"<span style=\"color:gray\">拒绝</span>",
			'4'		=>	"<span style=\"color:gray\">邮件未激活</span>",
			),
	
	
	
	/**
	 * 广告尺寸类型
	 */
	'AD_SIZE_TYPE' => array('1'=>'图片','2'=>'文字','3'=>'漂浮','4'=>'对联','5'=>'弹窗','6'=>'视窗'),				// 尺寸类型相关的配置

	/**
	 * 广告对应的状态值
	 */
	'AD_STATUS' => array('新增待审','修改待审','投放中','审核拒绝','计划停止'),

	'THINK_EMAIL' => array(
		'SMTP_HOST'   => 'smtp.163.com', //SMTP服务器
		'SMTP_PORT'   => '25', //SMTP服务器端口
		'SMTP_USER'   => 'zhts_vonwey@163.com', //SMTP服务器用户名
		'SMTP_PASS'   => 'zhtsjs003', //SMTP服务器密码
		'FROM_EMAIL'  => 'zhts_vonwey@163.com', //发件人EMAIL
		'FROM_NAME'   => '广告联盟', //发件人名称
		'REPLY_EMAIL' => '', //回复EMAIL（留空则为发件人EMAIL）
		'REPLY_NAME'  => '', //回复名称（留空则为发件人名称）
	),
		
	/**
	 * 广告计费形式
	 */
	'AD_PAY_TYPE' => array(
		'1' => 'cpm',  // 按照展示次数计费
		'2' => 'cpc',  // 按照点击次数计费	
	),	
	
	/**
	 * 广告计划的审核方式
	 */
	'AD_PLAN_CHECK' => array(
		'1' => "无需审核", 
		'2' => '手动审核',
		//'2' => "自动审核",	
	),
	
	/**
	 * 广告计划中广告金额的结算方式
	 */
	'CLEARING_FORM' => array(
		'1'	=> "日结",
		'2' => "周结",
		'3' => "月结",		
	),
	
	/**
	 * 广告计划网站的类型定向 
	 * 
	 */
	'DIRECTIONAL_SITE_TYPE_ARR' => array(
		'1' => '电商',
		'2' => '博客',
		'3' => '论坛',
		'4' => '新闻',
		'5' => '门户网站',
		'6' => '资讯',
		'7' => 'wijika',					
	),
	
	/**
	 * 广告计划网站星期定向
	 */
	'DIRECTIONAL_WEEK_ARR' => array(
		'1' => '星期一',
		'2' => '星期二',
		'3' => '星期三',
		'4' => '星期四',
		'5' => '星期五',
		'6' => '星期六',
		'7' => '星期天',
	),
	
	/**
	 * 广告计划时间定向
	 */
	'DIRECTIONAL_TIME_ARR' => array(
		'1' => '0:00 - 0:59',
		'2' => '1:00 - 1:59',
		'3' => '2:00 - 2:59',
		'4' => '3:00 - 3:59',
		'5' => '4:00 - 4:59',
		'6' => '5:00 - 5:59',
		'7' => '6:00 - 6:59',
		'8' => '7:00 - 7:59',
		'9' => '8:00 - 8:59',
		'10' => '9:00 - 9:59',
		'11' => '10:00 - 10:59',
		'12' => '11:00 - 11:59',
		'13' => '12:00 - 12:59',
		'14' => '13:00 - 13:59',
		'15' => '14:00 - 14:59',
		'16' => '15:00 - 15:59',
		'17' => '16:00 - 16:59',
		'18' => '17:00 - 17:59',
		'19' => '18:00 - 18:59',
		'20' => '19:00 - 19:59',
		'21' => '20:00 - 20:59',
		'22' => '21:00 - 21:59',
		'23' => '22:00 - 22:59',
		'24' => '23:00 - 23:59',
	),
	/*
	 * 网站对应的状态值
	 */
	'SITE_STATUS' => array(
		'1'	=>	'未验证',
		'2'	=>	'审核中',
		'3'	=>	'正常',
		'4'	=>	'锁定',
		'5'	=>	'拒绝',
	),
	/*
	 * 支付状态值
	 */
	'PAY_STATUS' => array(
		'1'	=>	'未支付',
		'2'	=>	'已支付',
		'3'	=>	'异常',
	),
	/*
	 * 业绩状态值
	 */
	'PERFORMANCE_STATUS' => array(
		'1'	=>	'未确认',
		'2'	=>	'已确认',
		'3'	=>	'无效',
	),
);
?>